from konlpy.tag import Kkma
from konlpy.utils import pprint

kkma = Kkma()
pprint(kkma.sentences("여러분, 안녕! 반갑습니다.")) # ['여러분, 안녕! 반갑습니다.']

print(kkma.nouns("제1조(범죄의 성립과 처벌)①범죄의 성립과 처벌은 행위 시의 법률에 의한다."))
# 결과: ['저', '1', '1조', '조', '범죄', '성립', '처벌', '행위', '시의', '법률']

print(kkma.pos("제1조(범죄의 성립과 처벌)①범죄의 성립과 처벌은 행위 시의 법률에 의한다."))
# 결과: [('저', 'NP'), ('의', 'JKG'), ('1', 'NR'), ('조', 'NNG'), ('(', 'SS'), 
# ('범죄', 'NNG'), ('의', 'JKG'), ('성립', 'NNG'), ('과', 'JC'), ('처벌', 'NNG'), 
# (')', 'SS'), ('①', 'SW'), ('범죄', 'NNG'), ('의', 'JKG'), ('성립', 'NNG'), 
# ('과', 'JC'), ('처벌', 'NNG'), ('은', 'JX'), ('행위', 'NNG'), ('시의', 'NNG'), 
# ('법률', 'NNG'), ('에', 'JKM'), ('의하', 'VV'), ('ㄴ다', 'EFN'), ('.', 'SF')]